In [131]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns 
from sklearn.preprocessing import LabelEncoder

In [132]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [133]:
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

# Mean & Median & Mode

In [134]:
df['age']=df['age'].fillna(df['age'].mean())
# df['age']=df['age'].fillna(df['age'].median())
df['embarked']=df['embarked'].fillna(df['embarked'].mode()[0])
df['embark_town']=df['embark_town'].fillna(df['embark_town'].mode()[0])

In [135]:
df.isnull().sum().sort_values(ascending=False)

deck           688
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

#  K-Nearest Neighbors (KNN)

In [136]:
df_1=sns.load_dataset("titanic")
df_1.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [137]:
df_1['embarked']=LabelEncoder().fit_transform(df_1['embarked'])
df_1['embark_town']=LabelEncoder().fit_transform(df_1['embark_town'])

In [138]:
df_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,2,Third,man,True,NaN,2,no,False
1,1,1,female,38.0,1,0,71.2833,0,First,woman,False,C,0,yes,False
2,1,3,female,26.0,0,0,7.9250,2,Third,woman,False,NaN,2,yes,True
3,1,1,female,35.0,1,0,53.1000,2,First,woman,False,C,2,yes,False
4,0,3,male,35.0,0,0,8.0500,2,Third,man,True,NaN,2,no,True

In [139]:
from sklearn.impute import KNNImputer
imputer=KNNImputer(n_neighbors=5)
df_1['age']=imputer.fit_transform(df_1[['age']])
df_1['embarked']=imputer.fit_transform(df_1[['embarked']])

In [140]:
df_1.isnull().sum().sort_values(ascending=False)

deck           688
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

# Regression Imputation

In [141]:
df_2=sns.load_dataset("titanic")
df_2.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
survived         0
pclass           0
sex              0
sibsp            0
parch            0
fare             0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [143]:
df_2['embarked']=LabelEncoder().fit_transform(df_2['embarked'])

In [144]:
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
imputer=IterativeImputer(max_iter=10)
df_2['age']=imputer.fit_transform(df_2[['age']])
df_2['embarked']=imputer.fit_transform(df_2[['embarked']])

In [145]:
df_2.isnull().sum().sort_values(ascending=False)

deck           688
embark_town      2
survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
alive            0
alone            0
dtype: int64